/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "comichive_hero_R4wkaM": {
      "type": "comichive-hero",
      "settings": {
        "hero_image": "shopify://shop_images/pexels-introspectivedsgn-7524992.jpg"
      }
    },
    "comichive_textsection_yYHQNK": {
      "type": "comichive-textsection",
      "settings": {
        "section_title": "Where passion meets panels",
        "section_description": "<p>At Comic Hive, we believe that every comic book tells a story beyond its pages. Whether you’re a lifelong collector, a casual reader, or just diving into the world of superheroes and graphic novels, we’re here to fuel your passion. Our mission is to provide an extensive collection of comics, manga, and collectibles, all curated with care and delivered with enthusiasm. More than just a store, Comic Hive is a community where fans can connect, discover, and celebrate the art of storytelling.</p>",
        "section_image": "shopify://shop_images/batman.png",
        "section_primarybt_text": "See store",
        "section_primarybt_url": "shopify://collections/all",
        "section_secondarybt_toggle": false,
        "section_secondarybt_text": "",
        "section_secondarybt_url": ""
      }
    },
    "comichive_newsletter_DEUwmg": {
      "type": "comichive-newsletter",
      "settings": {
        "news_title": "Join newsletter",
        "news_description": "<p>Stay connected with us and get the inside scoop on new comic releases, exclusive discounts, special events, and much more. By joining our newsletter, you’ll be the first to know about everything happening in the world of comics. We’ll deliver updates directly to your inbox, ensuring you’re always in the loop. Sign up today and make sure you're never left behind on the latest comics, deals, and offers we have in store!</p>",
        "news_image": "shopify://shop_images/mailbox.png",
        "news_primarybt_text": "Join newsletter",
        "news_primarybt_url": "https://www.google.com"
      }
    }
  },
  "order": [
    "comichive_hero_R4wkaM",
    "comichive_textsection_yYHQNK",
    "comichive_newsletter_DEUwmg"
  ]
}
